[
  {
    "Heading": "And my god",
    "Text": "Is superiorty complex actually any good ? I mean I remeber I was in my 3rd sem and my batch mate told me that superiority complex is somewhat good. And now moroever I do not get the point there was a tamil local in his 2nd year, I had no fucking idea that I would even talk to him but then again he started at me like \"Oh you are big shot or what\" and that is fucking my head so much like what is this with small town mentality. Fuck bro we in a smoking room of a bar whats the deal w you, enjoy your beer and lmk have my jagger shot cheap fuck. Behenchod it's so fucking numbing my brain rn as if I really do want to take action, but no point as I would take action I'm no better than him. And I have lived that superiority complex life and till a point I was fine but it does no good for anyone. I guess it's just village propogandic mentality here. \r\n\r\nSo SDN, hmm don't feel like studying this, since I got a cheatcode of keeping phone. Bad habit, really fucks you for sem exam, like maybe the feeling is good but at end you know it's wrong and that's something we should never forget diff b/w right nd wrong. Because many people have. I want to get this making up scenarious out my head as it just fuels my anger more nd more. No cause \r\n\r\nNow in my final year I have started to remember more about as to who am I, cause fights and anger is constant and situation which you may get post that anger that's something we can have a charge about because think, our anger is expressesed through our high pitch voice, bad expressions hand movement. So if we just control these expressions then our anger is still with us and accordingly we can act upon the situation in a more better manner, because then the other person is convienced we are not angry so no harm right. Then we can manipulate or do fuck one latter cause the person will not think when they'll speak, and thats' what we want, that other person not thinking before speaking as then we can get information out one, maybe even get one to say wrong things which are against one morals. Hence patience is very important fs fs ",
    "image": "/photos/1761325295850-IMG_0606.JPG"
  },
  {
    "Heading": "Kon kho 9:55 pm ",
    "Text": "I guess writing in silence is more better as it does not give any emotions out of hand and just brings what you were feeling before, I mean that's the case with me. Recently it was Diwali 25' nd my god so much drama I saw every where. And it just made me question as to why drama happens around me and not with me, as then people told me I radiate energy, now I mean i get it that I'm fun. Like I never got bored with me anywho I guess this is a narcistic behaviour, but I'm not the one with a psychology degree. \n\n10:44 \n\nSo okay I have taken another impulsive decision which can cost me latter on. Not sure how but surely can, I think in a few days will be a good time when I change my number from the present one, since I just cannot handle people's expectations from me for a illegal thing and it saddens me more as to what purpose I hold in people's life. I will slowly start producing on particular set of events which has occured with me over time, and while I write it please remember there's another side of what might have happened as well, it;s just my perception of things. As like in recent I got homeless not fun for sure but yes a drive. I feel somewhat alone but at the same time it's not too much alone it's just fine actually. Reason I brought up this blog is to capture me and my ideas as to who am I. My end term goal which I think will take atleast a year is to get a AI personalised as me so that people can talk to me just like everyday to that AI with my personallity. It for sure is stupid but as is a 3 year old kid capturing and learning from it's surroundings. \n",
    "image": "IMG_4193.JPG"
  },
  {
    "Heading": "Base",
    "Text": "pgp ",
    "image": ""
  },
  {
    "Heading": "TO = Turn on 4:59am",
    "Text": "right now motive is to get to the get to the dreeds using vpns \r\nfirst step download a tor on vm, ubuntu right now using terminal based, also downloading tor to see the tra. fic I'm getting sending out. Time to go out of service. SO tor can fuck me up, if the police of this area is really good then there's a chance I can get fucked up. Yet neighbours wife, so I don't think there should be an issue. got a puzzle to crack ws fun, match domain and match w that. another puzzle. This is very dangerous just be chills ",
    "image": ""
  },
  {
    "Heading": "LeetCode-1 7th Oct ",
    "Text": "First question valid anagram. \r\n\r\nSo general approach in regards to each problem will be, solve on paper then explain the logic here in this and pu u pu, next question !!\r\n\r\nValid Anagram: \r\nBrute Force approach, so we will sort both the strings and check letter by letter. Moroever incase the length is not matching it automatically is not. And since our return is a bool type so ig the algo should be like : \r\n\r\nSTART ->Size Match-> SORT -> Loop(Condition)-> return false, loop executed successfully return true \r\n\r\nIn practice the code looks like \r\n'''\r\n        sort(s.begin(),s.end());\r\n        sort(t.begin(),t.end());\r\n        if(s.size()!=t.size())\r\n        return false;\r\n\r\n        for(int i=0;i<s.size();i++){\r\n            if(s[i]!=t[i])\r\n            return false; \r\n        }\r\n        return true;\r\n'''\r\nThis is brute approach, how about now, I fw it since time complexity was not v good. \r\nIf I'm sorting let's try with juct checking strings if they match instead of each char.\r\n\r\n'''\r\nsort(s.begin(),s.end());\r\n        sort(t.begin(),t.end());\r\n        if(s.size()!=t.size())\r\n        return false;\r\n        if(s!=t)\r\n            return false; \r\n        \r\n        return true;\r\n'''\r\nThis also works, but just doesn't satisfies me. Feels like smth is missing, ig back to pen nd paper for hash. For hash I don't think we need to actually sort, since it's taking in all the chars. nd then condition \r\n\r\nSo hash map algo should be \r\nStart-> <char,int> hash -> Entry -> Remove entry nd anywhere the char : int is 0 false. Very vague I peeped into solution. 😶‍🌫️😶‍🌫️\r\n\r\n'''\r\n if (s.size() != t.size()) return false;\r\n        unordered_map<char, int> map;\r\n        for (char c : s) {\r\n            map[c]++;\r\n        }\r\n\r\n        for (char c : t) {\r\n            if (map.find(c) == map.end() || map[c] == 0) return false;\r\n            map[c]--;\r\n        }\r\n        return true;\r\n'''\r\nNext question \r\nGroup of Anagrams, I feel so distracted as I sit, like everything is calling me. let's work about this probem. \r\nSo we group the alike anagrams, so we can just sort each string, and w it we add the orginal str. like <string, vector<string>>\r\nAlgo would be: \r\nStart-> check of sorts nd add org-> extract the vectors nd add to a 2-d vec. \r\nsimple right, maybe solution was right there when I opened the link. \r\nThe code which I wrote rn... \r\n'''\r\n unordered_map<string,vector<string>> um;\r\n        for(string p: strs){\r\n            string s = p;\r\n            sort(s.begin(),s.end());\r\n            um[s].push_back(p);\r\n        }\r\n        vector<vector<string>> r;\r\n        for(auto [key,pair]: um){\r\n            r.push_back(pair);\r\n        }\r\n        return r;\r\n'''\r\nI feel like there should be a timer as well on this page yk just for BC, like I should track how much time I give to my works right. \r\nSo for blog two things has popped, category of blog nd timer. Category will take time because I need to write more to understand how to categorise them. \r\n\r\nNext question I feel fresh, I can go about it, fuck commercial music shit is addictive. Like porn to ears which in releases dopamine nd when the spike is done. We have brain fog. Ig recognising patterns is good, IDK, how can I be so sure about myself, but recognising patterns is neccessary based of the situation one maybe at. \r\n\r\nENCODE AND DECODE: \r\nThis problem is blocked because leetcode subscription, but fuck dis. I got neetcode. \r\nFuck neet code !! Input: \r\n[\"neet\",\"code\",\"love\",\"you\"]\r\n\r\nOutput:[\"neet\",\"code\",\"love\",\"you\"]\r\n\r\nTF is tgis. Like take in the input nd produce the same output is that the goal. I don't guess so. Ig I'll use geek code for better understanding. in neet code. \r\nclass Solution {\r\npublic:\r\n    string encode(vector<string>& strs) {}\r\n    vector<string> decode(string s) {}\r\n};\r\nSo two functions, Like I lose the motivation to code, like I start to feel lazy. ig this question is to be solved from python and not c++. Clear choice. \r\nSo I will solve 3 questions in my night attempt. At 9'oclock Ig works!! \r\nThen wht is next now ..? cons. \r\nOn render I cannot save data wtf !! \r\nig I will need to get a domain. \r\n",
    "image": "IMG_4107.JPG"
  },
  {
    "Heading": "AuthOver in my Sever side",
    "Text": "I really wish to get this done with tonight it's 12 past 27. and the music vibes !! I wish I could also share the music what I'm listening to. \r\n\r\nSo this is my entry page. app.get('/entry', (req, res) => {\r\n    res.sendFile(path.join(__dirname, 'server-side.html')); \r\n});\r\nRight now it's defined in such manner which is not static. for static I would have to use a middleware. \r\nRN I have two priorities: \r\n * Made a seperate folder for routes and manage them there, since because of clusturing and everything. \r\n* Add Auth0 over my entry page. main reason I want to have a separate folder for routes. \r\n\r\nSo priority, Routes diff !! \r\n\r\n",
    "image": "IMG_4094.JPG"
  },
  {
    "Heading": "Can be deleted right",
    "Text": "So now I'm adding new features over the website. Plan is to be done with contact us page, and have a clear structure as to how to go about conspire, or wht ever it has to be said. ",
    "image": "IMG_3998.JPG"
  },
  {
    "Heading": "TEST",
    "Text": "TEST",
    "image": ""
  }
]